ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    // Init Rx buffer
	if ( eRING_BUFFER_OK != ring_buffer_init( &g_rx_buf, BLE_P_RX_BUF_SIZE, &g_rx_buf_attr ))
	{
		status = eBLE_P_ERROR;
	}

    // Init BLE stack
    status |= ble_p_stack_init();

    // Init GAP (connection parameters)
    status |= ble_p_gap_init();
    
    // Init GATT
    status |= ble_p_gatt_init();
    
    // Init advertisement
    status |= ble_p_adv_init();

    // Init BLE connection library
    status |= ble_p_conn_init();


    custom_service_init();



    // Init success
    if ( eBLE_P_OK == status )
    {
        gb_is_init = true;

        // Start advertising     
        status = ble_p_adv_start();
    }



    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral get init status
*
* @param[out] 	p_is_conn   - Connection status, true if initiated
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_is_init (bool * const p_is_init)
{
    ble_p_status_t status = eBLE_P_OK;

    if ( NULL != p_is_init )
    {
        *p_is_init = gb_is_init;
    }
    else
    {
        status = eBLE_P_ERROR;
    }

    return status;  
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral get connection status
*
* @param[out] 	p_is_conn   - Connection status, true if connected
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_is_connected(bool * const p_is_conn)
{
    ble_p_status_t status = eBLE_P_OK;

    if ( NULL != p_is_conn )
    {
        if ( g_ble_p.conn_handle == BLE_CONN_HANDLE_INVALID )
        {
            *p_is_conn = false;
        }
        else
        {
            *p_is_conn = true; 
        }
    }
    else
    {
        status = eBLE_P_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral start advertising
*
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_adv_start(void)
{
    ble_p_status_t  status          = eBLE_P_OK;
    bool            is_connected    = false;

    BLE_P_ASSERT( true == gb_is_init );

    // Get connection flag
    ble_p_is_connected( &is_connected );

    if (    ( true == gb_is_init )
        &&  ( false == g_ble_p.is_adv )
        &&  ( false == is_connected ))
    {
        // Start advertisement
        if ( NRF_SUCCESS != ble_advertising_start( &g_adv_instance, BLE_ADV_MODE_FAST ))
        {
            status = eBLE_P_ERROR;
    
            BLE_P_DBG_PRINT( "BLE_P: Advertisement start error!" ); 
        }
    }
    else
    {
        status = eBLE_P_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral stop advertising
*
* @note     It is recommended to setup advertise duration rather that
*           calling that function as BLE Advertisement library don't 
*           really support advertisement stop.
*
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_adv_stop(void)
{
    ble_p_status_t  status          = eBLE_P_OK;
    bool            is_connected    = false;

    BLE_P_ASSERT( true == gb_is_init );

    // Get connection flag
    ble_p_is_connected( &is_connected );

    if (    ( true == gb_is_init )
        &&  ( true == g_ble_p.is_adv )
        &&  ( false == is_connected ))
    {
        // Stop advertisement library
        if ( NRF_SUCCESS != ble_advertising_start( &g_adv_instance, BLE_ADV_MODE_IDLE ))
        {
            status = eBLE_P_ERROR;
        
            BLE_P_DBG_PRINT( "BLE_P: BLE adv stop error!" ); 
        }

        // Stop advertisement diretly via SoftDevice
        if ( NRF_SUCCESS != sd_ble_gap_adv_stop( g_adv_instance.adv_handle ))
        {
            status = eBLE_P_ERROR;
        
            BLE_P_DBG_PRINT( "BLE_P: SD adv stop error!" ); 
        }
    }
    else
    {
        status = eBLE_P_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		Is BLE Peripheral advertising
*
* @param[out]   p_is_adv    - Pointer to advertisement status
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_is_adv(bool * const p_is_adv)
{
    ble_p_status_t status = eBLE_P_OK;

    if ( NULL != p_is_adv )
    {
        *p_is_adv = g_ble_p.is_adv;
    }
    else
    {
        status = eBLE_P_ERROR;
   }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral write 
*	
* @note     This function push data to GATTS Tx characteristics.
*
* @note     Tx characteristics is defined as server-initiated update with
*           "Notification" type. 
*
* @note     This function shall not be called if connection is not established!
*
* @param[in] 	p_data      - Pointer to data for transmit
* @param[in] 	len         - Lenght of data in bytes
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_write(const uint8_t * const p_data, const uint16_t len)
{
    ble_p_status_t  status          = eBLE_P_OK;
    bool            is_connected    = false;

    BLE_P_ASSERT( true == gb_is_init );
	BLE_P_ASSERT( NULL != p_data );
	BLE_P_ASSERT( len > 0 );

    // Get connection status
    (void) ble_p_is_connected( &is_connected );

    BLE_P_ASSERT( true == is_connected );

	if	(	( true == gb_is_init ) 
		&&	( NULL != p_data )
        &&  ( len > 0 )
        &&  ( true == is_connected ))
	{
        // Prepare notification data
        const ble_gatts_hvx_params_t hvx_params_tx = 
        {
            .handle     = tx_char_handles.value_handle,
            .p_data     = (uint8_t*) p_data,
            .p_len      = (uint16_t*) &len,
            .type       = BLE_GATT_HVX_NOTIFICATION
        };

        // Push data to client via Notify
        if ( NRF_SUCCESS != sd_ble_gatts_hvx( g_ble_p.conn_handle, &hvx_params_tx ))
        {
            status = eBLE_P_ERROR;
        }
	}
	else
	{
		status = eBLE_P_ERROR;
	}

